blog/controllers/ApiController.php

    public function actionPosts()
    {
        $query = Post::find();
        Yii::$app->response->format = Response::FORMAT_JSON;

        if ($id = Yii::$app->request->get('id')) {
            $query->where([
                'id' => $id
            ]);
            $posts = $query->one();
---
SELECT * FROM `posts` WHERE `id`='2'

    public function actionCreate()
    {
        $newPost = new Post();
        $newPost->setAttributes(Yii::$app->request->post());

        return $newPost->save() ? $newPost->id : 'false';
---
INSERT INTO `posts` (`title`, `categories`, `content`) VALUES ('Test', 'Test', 'TEST TEST TEST')

    public function actionDelete()
    {
        Yii::$app->response->format = Response::FORMAT_JSON;
        $id = Yii::$app->request->get('id');
        if (empty($id)) {
            return 'false';
        }

        $post = Post::findOne(['id' => $id]);
        $response = $post->getAttributes();
        $post->delete();
---
SELECT * FROM `posts` WHERE `id`='10'
DELETE FROM `posts` WHERE `id`=10